/* 如果一年是12個月，一個月都是30天，一天是24小時，1小時是60分，1分是60秒。
   讓使用者輸入一正整數代表總秒數，然後轉換成年月天時分秒。
   例如：使用者輸入90654。你的程式會輸出0 0 1 1 10 54\n。
   因為90654 = 86400(1天) + 3600(1小時) + 600(10分) + 54(秒) */
#include<iostream>
using namespace std;
int main(){
	int s, y, m, d, h, min, sec;
	cin >> s;
	sec = s % 60;
	min = (s / 60) % 60;
	h = (s / 60 / 60) % 24;
	d = (s / 60 / 60 / 24) % 30;
	m = (s / 60 / 60 / 24 / 30) % 12;
	y = s / 60 / 60 / 24 / 30 / 12;
	cout << y << " " << m << " " << d << " " << h << " " << min << " " << sec << endl;
	return 0; 
}
